Revit 2021.1 API
RebarInSystem Properties
The RebarInSystem type exposes the following members.
Properties
Name | Description
ArrayLength
 Identifies the distribution path length of rebar set.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BarsOnNormalSide
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal. For the current implementation of RebarInSystem, this property will always return true, but it is included in the RebarInSystem interface for consistency with the Rebar class.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LayoutRule
 Identifies the layout rule of rebar set.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MaxSpacing
 Identifies the maximum spacing between rebar in rebar set.
Name
A human readable name for the Element.
 (Inherited from Element.)
Normal
 A unit-length vector normal to the plane of the rebar
NumberOfBarPositions
 The number of bar positions available in the rebar.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Quantity
 Identifies the number of bars in rebar set. For the current implementation of RebarInSystem, this property will always return the same number as NumberOfBarPositions, since the first and last bars of a RebarInSystem set cannot be suppressed. However, it is included in the RebarInSystem interface for consistency with the Rebar class.
RebarShapeId
 The RebarShape element that defines the shape of the rebar.
ScheduleMark
 The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
SystemId
 The Id of an AreaReinforcement or PathReinforcement element that owns this element.
TotalLength
 The length of an individual bar multiplied by Quantity.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
VersionGuid
 Get the element version Guid.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Volume
 The volume of an individual bar multiplied by Quantity.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace